Revit 2027 API
RebarShapeDefinitionByArc.AddConstraintArcLength Method
 Specify a parameter to drive the arc length of the shape.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void AddConstraintArcLength(
	ElementId paramId
)
Public Sub AddConstraintArcLength (
	paramId As ElementId
)
public:
void AddConstraintArcLength(
	ElementId^ paramId
)
member AddConstraintArcLength :
        paramId : ElementId -> unit
Parameters
paramId ElementId
 Id of a parameter to drive the constraint. To obtain the id of a shared parameter, call RebarShape.GetElementIdForExternalDefinition().
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
RebarShapeDefinitionByArc Class
Autodesk.Revit.DB.Structure Namespace